# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv5 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolov5
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov5n.yaml' will call yolov5.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [1.00, 0.50, 1024]
  s: [1.00, 1.00, 1024]
  m: [1.00, 1.50, 1024]
  l: [1.00, 2.00, 1024]

# YOLOv5 v6.0 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvMaxPool, [24]]    # 0-P2/4
  - [-1, 1, ShuffleNetV2_InvertedResidual, [116, 2]] # 1-P3/8
  - [-1, 3, ShuffleNetV2_InvertedResidual, [116, 1]] # 2
  - [-1, 1, ShuffleNetV2_InvertedResidual, [232, 2]] # 3-P4/16
  - [-1, 7, ShuffleNetV2_InvertedResidual, [232, 1]] # 4
  - [-1, 1, ShuffleNetV2_InvertedResidual, [464, 2]] # 5-P5/32
  - [-1, 3, ShuffleNetV2_InvertedResidual, [464, 1]] # 6
  - [-1, 1, SPPF, [1024, 5]]  # 7

# YOLOv5 v6.0 head
head:
  - [-1, 1, Conv, [512, 1, 1]] # 8
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C3, [512, False]]  # 11

  - [-1, 1, Conv, [256, 1, 1]] # 12
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C3, [256, False]]  # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 3, C3, [512, False]]  # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C3, [1024, False]]  # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)
